Repository: Ragnarom-kun/Nano_3_Gymbro
Catalog: Nano3_Gymbro/Localizable.xcstrings
Source language: en
Languages: ar, id

source: % of 1RM
ar: % من 1RM
id: % 1RM

source: 1RM Calculator
ar: حساب 1RM
id: Kalkulator 1RM

source: 1RM Progress
ar: تقدم الحد الأقصى للتكرار الواحد (1RM)
id: Progres 1RM

source: Add New Exercise
ar: إضافة تمرين جديد
id: Tambah jenis latihan baru

source: Add New Record
ar: إضافة سجل جديد
id: Tambah rekor baru

source: Add to Progress
ar: إضافة إلى التقدم
id: Catat Perkembangan

source: Based on your RPE of %1$@, you should add %2$@%% to your current weight of %3$@ kg. Increase it to %4$@ kg to keep progressing and building strength. Keep up the great work!
ar: بناءً على RPE الخاص بك البالغ %1$@، يجب أن تضيف%2$@% إلى وزنك الحالي البالغ %3$@ كجم. زد الوزن إلى %4$@ كجم للمضي قدماً وبناء القوة. استمر في العمل الرائع!
id: Berdasarkan RPE Anda sebesar %1$@, Anda sebaiknya menambah %2$@% dari berat saat ini yaitu %3$@ kg. Tingkatkan menjadi %4$@ kg untuk terus berkembang dan membangun kekuatan. Tetap semangat!

source: Best
ar: الأفضل
id: Terbaik

source: Brzychi and Ware et al. found that performing fewer than 10 reps to fatigue provides a more accurate estimate of your 1RM
ar: وجد Brzychi (4) و Ware et al. (17) أن أداء أقل من 10 تكرارات حتى الإرهاق يوفر تقديرًا أكثر دقة لقيمة 1-RM الخاصة بك.
id: Brzychi dan Ware dkk. menemukan bahwa melakukan kurang dari 10 repetisi hingga lelah memberikan estimasi yang lebih akurat dari 1-RM Anda.

source: Calculate
ar: احسب
id: Hitung

source: Calculator
ar: آلة حاسبة
id: Kalkulator

source: Cannot calculate. Active Exercise is missing or empty.
ar: لا يمكن الحساب. التمرين النشط مفقود أو فارغ.
id: Tidak bisa calculate. Active Exercise tidak ada atau kosong.

source: Cannot calculate. activeExercise is missing or empty.
ar: لا يمكن الحساب. التمرين النشط مفقود أو فارغ.
id: Tidak bisa calculate. activeExercise tidak ada atau kosong.

source: Could have done 5 more reps
ar: كنت أستطيع القيام بخمس تكرارات إضافية

source: Could have done 6 more reps
ar: كنت أستطيع القيام بست تكرارات إضافية

source: Could have done 7 more reps
ar: كنت أستطيع القيام بسبع تكرارات إضافية

source: Could have done 8 more reps
ar: كنت أستطيع القيام بثماني تكرارات إضافية

source: Could have done 9 more reps
ar: كنت أستطيع القيام بتسع تكرارات إضافية

source: Current Weight: %@ kg
ar: الوزن الحالي: %@ كغ
id: Berat Saat Ini: %@ kg

source: Date
ar: تاريخ
id: Tanggal

source: Definitely could have done 1 more rep
ar: بالتأكيد كنت قادرًا على القيام بتكرار واحد إضافي
id: Pasti bisa melakukan 1 repetisi lagi

source: Definitely could have done 2 more reps
ar: بالتأكيد كنت قادرًا على القيام بتكرارين إضافيين
id: Pasti bisa melakukan 2 repetisi lagi

source: Definitely could have done 3 more reps
ar: التأكيد كنت قادرًا على القيام بثلاث تكرارات إضافية
id: Pasti bisa melakukan 3 repetisi lagi

source: Definitely could have done 4 more reps
ar: بالتأكيد كنت قادرًا على القيام بأربع تكرارات إضافية
id: Pasti bisa melakukan 4 repetisi lagi

source: Delete
ar: حذف
id: Hapus

source: Description
ar: الوصف
id: Deskripsi

source: Done
ar: تم
id: Selesai

source: Enter exercise
ar: أدخل التمرين
id: Masukkan jenis latihan

source: Exceeding 10 reps can reduce the accuracy of your RM value
ar: مكن أن يقلل تجاوز 10 تكرارات من دقة قيمة الحد الأقصى للتكرار.
id: Melebihi 10 repetisi dapat mengurangi keakuratan nilai RM Anda.

source: Exercise
ar: تمرين
id: Jenis Latihan

source: Exercise Type
ar: نوع التمرين
id: Jenis Latihan

source: Generate Plan
ar: إنشاء الخطة
id: Buat Plan

source: How We Calculate
ar: كيف نحسب
id: Bagaimana Kami Mengkalkulasi

source: Increase to %@ kg
ar: زيادة إلى %@ كغ
id: Tingkatkan menjadi %@ kg

source: It aids in autoregulation, precise training tracking, and planning for progressive weight.
ar: إنه يساعد في التنظيم الآلي، تتبع التدريب الدقيق، والتخطيط للوزن التدريجي
id: Ini membantu dalam pengaturan otomatis, pelacakan latihan yang presisi, dan perencanaan untuk peningkatan berat secara bertahap

source: Last
ar: الأخيرة
id: Terakhir

source: Last Update: %@
ar: آخر تحديث: %@
id: Update Terakhir: %@

source: Last Update: N/A
ar: آخر تحديث: غير متوفر
id: Update Terakhir: N/A

source: Maximal effort
ar: بذل أقصى جهد ممكن
id: Usaha Maksimal

source: Maybe could have done 1 more rep
ar: ربما كان بإمكاني القيام بتكرار واحد إضافي
id: Mungkin bisa melakukan 1 repetisi lagi

source: Maybe could have done 2 more reps
ar: ربما كنت أستطيع القيام بتكرارين إضافيين
id: Mungkin bisa melakukan 2 repetisi lagi

source: Maybe could have done 3 more reps
ar: ربما كنت أستطيع القيام بثلاث تكرارات إضافية
id: Mungkin bisa melakukan 3 repetisi lagi

source: Maybe could have done 4 more reps
ar: ربما كنت أستطيع القيام بأربع تكرارات إضافية
id: Mungkin bisa melakukan 4 repetisi lagi

source: Mayhew et al. Formula
ar: معادلة Mayhew et al.
id: Formula Mayhew et al.

source: N/A %@
ar: غ/م %@

source: Name
ar: الاسم
id: Nama

source: New Exercise
ar: تمرين جديد
id: Jenis Latihan Baru

source: New Record
ar: رقم قياسي جديد
id: Rekor Baru

source: No active exercise selected
ar: لم يتم اختيار تمرين نشط
id: Tidak ada jenis latihan yang dipilih

source: No Data Available
ar: لا توجد بيانات
id: Tidak ada data yang tersedia

source: OK
ar: حسناً

source: Personal Record
ar: سجل شخصي
id: Rekor Personal

source: Progress
ar: التقدم
id: Perkembangan

source: Progressive Overload Plan
ar: خطة التحميل الزائد التدريجي
id: Rencana Beban Bertahap

source: Repetition weight, a load less than 1RM used to perform repetitions
ar: وزن التكرار (repetition weight)، حمولة أقل من 1 RM تُستخدم لإجراء التكرارات
id: Repetition weight, beban kurang dari 1RM yang digunakan untuk melakukan pengulangan

source: Repetitions to fatigue
ar: التكرارات حتى الإجهاد

source: Reps
ar: تكرار

source: RepWt
ar: وزن التكرار
id: Berat Reps

source: Results
ar: النتائج
id: Hasil

source: RM has been added to progress.
ar: تمت إضافة RM إلى التقدم
id: RM telah ditambahkan ke perkembangan

source: RPE (Rating of Perceived Exertion) measures training intentisty, especially in weightlifting, indicating how many reps you could still perform in your last set.
ar: يقيس RPE (تصنيف الجهد المدرك) كثافة التدريب، خاصةً في رفع الأثقال، ويشير إلى عدد التكرارات التي لا يزال بإمكانك القيام بها في آخر مجموعة. وهو يساعد في التنظيم التلقائي وتتبع التدريب بدقة والتخطيط للوزن التدريجي
id: RPE (Rating of Perceived Exertion) mengukur intensitas latihan, terutama dalam angkat beban, menunjukkan berapa banyak repetisi yang masih dapat Anda lakukan dalam set terakhir Anda.

source: RPE Measurement
ar: قياس RPE
id: Pengukuran RPE

source: Segments
ar: شرائح
id: Segmen

source: Sets
ar: مجموعة

source: Start
ar: ابدأ
id: Awal

source: Success
ar: تم بنجاح
id: Sukses

source: Value
ar: القيمة
id: Nilai

source: Value (Kg)
ar: القيمة(Kg)
id: Nilai (Kg)

source: Value (lbs)
ar: القيمة(lbs)
id: Nilai (lbs)

source: Volume
ar: حجم

source: Weight
ar: الوزن
id: Berat

source: Weight Lift
ar: الوزن
id: Berat Diangkat

source: What is RPE
ar: ما هو RPE
id: Apa itu RPE

source: What is RPE?
ar: ما هو RPE؟
id: Apa itu RPE?

source: Why max 10 reps input?
ar: لماذا الحد الأقصى لإدخال ١٠ تكرارات؟
id: Mengapa maksimal 10 reps input?

source: Your 1RM is ..
ar: نتيجة 1RM الخاصة بك هي ..
id: 1RM anda adalah

source: Your Plan
ar: خطتك
id: Rencanamu

source: Your Progress
ar: تقدمك
id: Perkembanganmu
